In [1]:
#importing libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score

In [2]:
#reading dataset
df=pd.read_csv(r'C:\DSA\WEEK 15\Q&A\titanic_dataset.csv',index_col='PassengerId')
df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df.shape

(891, 11)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

In [5]:
#checking null values
df.isnull().sum()

Survived      0
Pclass        0
Name          0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64

In [6]:
#filling the null values with  mode for Embarked and Cabin' 
df['Embarked']=df['Embarked'].fillna(df['Embarked'].mode()[0])
df['Cabin']=df['Cabin'].fillna(df['Cabin'].mode()[0])

In [7]:
df.isnull().sum()

Survived      0
Pclass        0
Name          0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin         0
Embarked      0
dtype: int64

In [8]:
#for age replacing th enull values with median
df['Age'] = df['Age'].fillna(df['Age'].median())

In [9]:
df.isnull().sum()

Survived    0
Pclass      0
Name        0
Sex         0
Age         0
SibSp       0
Parch       0
Ticket      0
Fare        0
Cabin       0
Embarked    0
dtype: int64

In [10]:
#creating a new dataframe 
#Dropping some columns
df.drop(['Name','Ticket','Cabin'],axis=1,inplace=True)
df.head()

             Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
PassengerId
1                   0       3    male  22.0      1      0   7.2500        S
2                   1       1  female  38.0      1      0  71.2833        C
3                   1       3  female  26.0      0      0   7.9250        S
4                   1       1  female  35.0      1      0  53.1000        S
5                   0       3    male  35.0      0      0   8.0500        S

In [11]:
#Encoding
#Sex
df['Sex'] = df['Sex'].replace(["female", "male"], [0, 1])
#Embarked
df['Embarked'] = df['Embarked'].replace(['S', 'C', 'Q'], [1, 2, 3])
df.head()

             Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
PassengerId
1                   0       3    1  22.0      1      0   7.2500         1
2                   1       1    0  38.0      1      0  71.2833         2
3                   1       3    0  26.0      0      0   7.9250         1
4                   1       1    0  35.0      1      0  53.1000         1
5                   0       3    1  35.0      0      0   8.0500         1

In [12]:
X=df.drop(['Survived'],axis=1)
y=df['Survived']
from sklearn.model_selection import train_test_split
X_train,X_test,Y_train,Y_test=train_test_split(X,y,random_state=42,test_size=0.3)

In [13]:
#standard scaling
from sklearn.preprocessing import StandardScaler
scaler=StandardScaler()
X_train=scaler.fit_transform(X_train)
X_test=scaler.fit_transform(X_test)

In [14]:
#Naive-Bayes Classifier
from sklearn.naive_bayes import GaussianNB
classifer = GaussianNB()
classifer.fit(X_train,Y_train)
y_pred = classifer.predict(X_test)

from sklearn.metrics import accuracy_score,confusion_matrix
cm = confusion_matrix(Y_test,y_pred)
acc_score = accuracy_score(Y_test,y_pred)
print("Accuracy is =", acc_score)

Accuracy is = 0.7910447761194029

In [15]:
#Hyper tuning
# fitting Bernoulli Naive Bayes to training set

from sklearn.naive_bayes import BernoulliNB
classifier = BernoulliNB()
classifier.fit(X_train,Y_train)
cm = confusion_matrix(Y_test,y_pred)
y_pred = classifier.predict(X_test)
accuracy_score(Y_test,y_pred)

0.7649253731343284

In [ ]:
Performance doesn't improve after Hyper parameter tuning. Naive Bayes classifier has a very limited parameter set.So, hyper-parameter tuning may not be considered as a valid method to improve Naive Bayes classifier accuracy.